tests/jmeter/summary-pedido.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
SOAP - Crear Pedido,1,12,12,12,0.00,0.000%,83.33333,68.77,126.95,845.0
GET WSDL,1,16,16,16,0.00,0.000%,62.50000,703.37,8.00,11524.0
SOAP - Consultar ID 999,1,23,23,23,0.00,0.000%,43.47826,34.05,22.97,802.0
TOTAL,3,17,12,23,4.55,0.000%,130.43478,559.23,94.77,4390.3